In [1]:
import pandas as pd

In [2]:
url = 'https://github.com/tjwaterman99/boxofficemojo-scraper/releases/latest/download/revenues_per_day.csv.gz'
df = pd.read_csv(url, parse_dates=['date'], index_col='id')
df.head()

,date,title,revenue,theaters,distributor
id,,,,,
aa4ae6c8-451a-dc87-7390-14c510ef268a,2012-09-05,Ruby Sparks,6873,78.0,Fox Searchlight Pictures
c455b726-b014-90d6-2fc6-a6a6579cd9f5,2012-09-05,Joker,5433,74.0,UTV Motion Pictures
a2506b6a-c5e4-ea5d-e2b3-28c39c6aff9c,2012-09-05,Savages,4920,82.0,Universal Pictures
a91e2ce6-1dbf-0e7b-620f-f50070fef237,2012-09-05,Prometheus,4397,55.0,Twentieth Century Fox
6b036d78-4bb4-12bd-afcd-0abf12636d06,2012-09-05,Born to Be Wild,3719,33.0,Warner Bros.

In [3]:
df.keys()

Index(['date', 'title', 'revenue', 'theaters', 'distributor'], dtype='object')

In [4]:
# Sort DataFrame by date
df = df.sort_values(by='date')

# Print the smallest and largest dates
print("Smallest Date:", df['date'].min())
print("Largest Date:", df['date'].max())

Smallest Date: 2000-01-01 00:00:00
Largest Date: 2023-11-11 00:00:00

In [17]:
import requests
from bs4 import BeautifulSoup

In [21]:
def getData(year):
    url = f'https://www.boxofficemojo.com/year/{year}/?sortDir=asc&sort=rank&grossesOption=totalGrosses'

    # Send a GET request to the URL
    response = requests.get(url)

    df = pd.DataFrame()
    # Check if the request was successful (status code 200)
    if response.status_code == 200:
        # Parse the HTML content of the page
        soup = BeautifulSoup(response.content, 'html.parser')

        # Extract relevant information (modify this based on the structure of the webpage)
        # Example: Extracting movie titles
        df['movie_titles'] = [title.text.strip() for title in soup.find_all('td', class_='a-text-left mojo-field-type-release mojo-cell-wide')]
        df['movie_revenues'] = [title.text.strip() for title in soup.find_all('td', class_='a-text-right mojo-field-type-money mojo-estimatable')]

    return df

In [24]:
display(getData(2020))

                          movie_titles movie_revenues
0                    Bad Boys for Life   $206,305,244
1                   Sonic the Hedgehog   $148,974,665
2                        Birds of Prey    $84,158,461
3                             Dolittle    $77,047,065
4                    The Invisible Man    $70,410,000
..                                 ...            ...
195  Pray: The Story of Patrick Peyton        $72,347
196        Come and See2020 Re-release        $71,909
197                How to Build a Girl        $70,632
198             We Summon the Darkness        $60,794
199              My Brothers' Crossing        $59,395

[200 rows x 2 columns]

In [38]:
df_all = pd.DataFrame()

for i in range(1980, 2015):
    temp = getData(i)
    df_all = pd.concat([df_all, temp], ignore_index=True)

In [39]:
display(df_all)

                                        movie_titles movie_revenues
0     Star Wars: Episode V - The Empire Strikes Back   $209,398,025
1                                             9 to 5   $103,290,500
2                                         Stir Crazy   $101,300,000
3                                          Airplane!    $83,453,539
4                              Any Which Way You Can    $70,687,344
...                                              ...            ...
6656                                           Pride     $1,446,634
6657                             Two Days, One Night     $1,436,243
6658                                           Locke     $1,375,769
6659                                   Gimme Shelter     $1,359,910
6660                                   Force Majeure     $1,359,497

[6661 rows x 2 columns]